Revit 2026 API

# WireSizeSetReverseIterator Method

---

Retrieve a backward moving iterator to the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual WireSizeSetIterator ReverseIterator()
```
```vb
Public Overridable Function ReverseIterator As WireSizeSetIterator
```
```cpp
public:
virtual WireSizeSetIterator^ ReverseIterator()
```
```fsharp
abstract ReverseIterator : unit -> WireSizeSetIterator
override ReverseIterator : unit -> WireSizeSetIterator
```

#### Return Value

WireSizeSetIteratorReturns a backward moving iterator to the set.

#### Reference

WireSizeSet Class

Autodesk.Revit.DB.Electrical Namespace